app/controllers/drinks_controller.rb

SELECT "drinks".* FROM "drinks"
---
  def index
    @drinks = Drink.all

SELECT  "drinks".* FROM "drinks" WHERE "drinks"."id" = ? LIMIT 1  [["id", 3]]
---
  def show
    @drink = Drink.find(params[:id])

INSERT INTO "drinks" ("name", "size", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Big Gulp"], ["size", "1 Liter"], ["created_at", "2016-04-28 02:01:05.886873"], ["updated_at", "2016-04-28 02:01:05.886873"]]
---
  def create
    @drink = Drink.new(allowed_params)

    if @drink.save

SELECT  "drinks".* FROM "drinks" WHERE "drinks"."id" = ? LIMIT 1  [["id", 2]]
---
  def edit
    @drink = Drink.find(params[:id])

SELECT  "drinks".* FROM "drinks" WHERE "drinks"."id" = ? LIMIT 1  [["id", 2]]
UPDATE "drinks" SET "name" = ?, "updated_at" = ? WHERE "drinks"."id" = ?  [["name", "Big Dip"], ["updated_at", "2016-04-28 02:11:36.784636"], ["id", 2]]
---
  def update
    @drink = Drink.find(params[:id])
    if @drink.update_attributes(allowed_params)

SELECT  "drinks".* FROM "drinks" WHERE "drinks"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "drinks" WHERE "drinks"."id" = ?  [["id", 2]]
---
  def destroy
    @drink = Drink.find(params[:id])
    @drink.destroy